class Book {
  final int id;
  final String title;
  final int chapter;

  const Book({this.id, this.title, this.chapter});
}

const BOOK = const {
  Book(id: 1, title: 'महाभारतको पृष्ठभूमि', chapter: 16),
  Book(id: 2, title: 'श्रीमद्भगवद् गीताको बारेमा समयको कलम', chapter: 3),
  Book(id: 3, title: 'श्रीमद्भगवद् गीता माहात्म्य', chapter: 2),
  Book(id: 4, title: 'श्रीमद्भगवद् गीता माहात्म्यको अनुसन्दान', chapter: 5),
  Book(
      id: 5,
      title: 'श्रीमद्भगवद् गीतामा भगवान श्रीकृष्ण नामको अर्थ',
      chapter: 1),
  Book(id: 6, title: 'श्रीमद्भगवद् गीतामा अर्जुनको नामको अर्थ', chapter: 1),
  Book(id: 7, title: 'श्रीमद्भगवद् गीता', chapter: 18),
};

const TITLE = const [
  'प्रथम अध्यायः-अर्जुनविषादयोग',
  'दोश्रो अध्यायः-सांख्ययोग',
  'तेस्रो अध्यायः-कर्मयोग',
  'चौथो अध्याय:-ज्ञानकर्मसन्यासयोग',
  'पाँचौ अध्यायः-कर्मसंन्यासयोग',
  'छैटौ अध्यायः-आत्मसंयमयोग',
  'सातौ अध्यायः-ज्ञानविज्ञानयोग',
  'आठौ अध्यायः-अक्षरब्रह्मयोग',
  'नबौ अध्यायः-राजविद्याराजगुह्ययोग',
  'दशौ अध्यायः-विभूतियोग',
  'एघारौ अध्यायः-विश्वरूपदर्शनयोग',
  'बाह्रौ अध्यायः-भक्तियोग',
  'तेह्रौ अध्यायः-क्षेत्रक्षत्रज्ञविभागयोग',
  'चौधौ अध्यायः-गुणत्रयविभागयोग',
  'पन्द्रौ अध्यायः-पुरुषोत्तमयोग',
  'सोह्रौ अध्यायः-दैवासुरसंपद्विभागयोग',
  'सत्रौ अध्यायः-श्रद्धात्रयविभागयोग',
  'अठाह्रौ अध्यायः-मोक्षसंन्यासयोग'
];
